In [60]:
# librarires xlrd to read xls file

In [61]:
import os 
import pandas as pd
import numpy as np

In [62]:
dir_items = os.listdir("data")

In [70]:
fields = ["REGION", "SHIPMONTH", "SECTIONS", "STATUS", 
          "BEDROOMS", "TITLED", "SECURED","LOCATION",
          "FOUNDATION","SQFT", "PRICE", ]
house_price = pd.DataFrame(columns=fields)
for file in dir_items:
    if file.endswith(".xlsx"):
        data = "data/" + file
        #print(pd.read_excel(data).columns)
        df = pd.read_excel(data, usecols=fields)
        house_price = pd.concat([house_price, df])
    else:
        pass
house_price.reset_index(drop=False, inplace=True)

In [71]:
house_price = house_price.replace(9, pd.NA)

In [72]:
house_price.isna().sum()

index             7
REGION            0
SHIPMONTH         0
SECTIONS          0
STATUS            2
BEDROOMS      10019
TITLED        21059
SECURED       28753
LOCATION      20625
FOUNDATION    20625
SQFT          10019
PRICE         10549
dtype: int64

In [73]:
# instances with no missing data
house_price = house_price.dropna()
house_price = house_price.drop(["index"], axis=1)
house_price.reset_index(drop=True, inplace=True)

In [79]:
house_price["SHIPMONTH"] = house_price["SHIPMONTH"].astype(str)
house_price["YEAR"] = house_price["SHIPMONTH"].str[0:4]
house_price["MONTH"] = house_price["SHIPMONTH"].str[4:]
house_price.drop(["SHIPMONTH"], axis=1, inplace=True)

In [82]:
house_price["YEAR"].value_counts()

2014    2655
2015    2453
2016    2412
2017    2222
2019    2175
2018    1191
2020    1011
Name: YEAR, dtype: int64

In [83]:
house_price.columns

Index(['REGION', 'SECTIONS', 'STATUS', 'BEDROOMS', 'TITLED', 'SECURED',
       'LOCATION', 'FOUNDATION', 'SQFT', 'PRICE', 'YEAR', 'MONTH'],
      dtype='object')

In [86]:
house_price = house_price[['REGION','YEAR', 'MONTH', 'SECTIONS', 'STATUS', 'BEDROOMS', 'TITLED', 'SECURED',
                          'LOCATION', 'FOUNDATION', 'SQFT', 'PRICE']]

In [87]:
house_price

,REGION,YEAR,MONTH,SECTIONS,STATUS,BEDROOMS,TITLED,SECURED,LOCATION,FOUNDATION,SQFT,PRICE
0,2,2014,01,1,2,3,2,1,1,3,1300,55800
1,2,2014,01,1,2,3,2,1,1,3,1300,57300
2,4,2014,01,1,2,1,2,1,3,2,600,42700
3,3,2014,01,2,2,3,2,1,3,3,1792,49900
4,2,2014,01,2,2,3,2,1,1,2,1404,95200
...,...,...,...,...,...,...,...,...,...,...,...,...
14114,5,2016,12,3,2,3,2,1,3,3,1800,94000
14115,5,2016,12,3,2,3,1,1,3,3,1800,95000
14116,5,2016,12,3,2,1,2,1,1,3,2100,170000
14117,5,2016,12,3,2,3,1,1,3,3,2400,152000
14118,5,2016,12,3,2,3,1,1,1,3,3000,134000